Repository: counter-reverse/python-docs-fr
Catalog: c-api/type.po
Languages: fr

source: Type Objects
fr: Type d'objets

source: The C structure of the objects used to describe built-in types.
fr: La structure en C des objets avait pour habitude de décrire les types natifs en python.

source: This is the type object for type objects; it is the same object as :class:`type` in the Python layer.
fr: Ceci est le type d'objet pour les autres types d'objets; C'est le même objet que :class:`type` dans la couche de Python.

source: Return true if the object *o* is a type object, including instances of types derived from the standard type object. Return false in all other cases.
fr: Retourne vrai si l'objet *o* est un type d'objet y compris les instances de types dérivé d'un objet de type standard. Retourne faux dans tous les autres cas.

source: Return true if the object *o* is a type object, but not a subtype of the standard type object. Return false in all other cases.
fr: Retourne vrai si l'objet *o* est un type d'objet mais pas un sous-type d'objet standard. Retourne faux dans tous les autres cas.

source: Clear the internal lookup cache. Return the current version tag.
fr: Nettoie le cache de recherche interne. Retourne la marque du drapeau courant.

source: Return the :c:member:`~PyTypeObject.tp_flags` member of *type*. This function is primarily meant for use with `Py_LIMITED_API`; the individual flag bits are guaranteed to be stable across Python releases, but access to :c:member:`~PyTypeObject.tp_flags` itself is not part of the limited API.
fr: Retourne le membre :c:member:`~PyTypeObject.tp_flags` du *type*. Cette fonction est conçue pour utiliser en priorité `Py_LIMITED_API`; les bits du drapeau son garanties pour être stables à travers les versions de Python, mais l'accès à :c:member:`~PyTypeObject.tp_flags` lui même n'est pas fourni par l'API.

source: Invalidate the internal lookup cache for the type and all of its subtypes. This function must be called after any manual modification of the attributes or base classes of the type.
fr: Confirme la non-validité du cache de recherche interne pour le type et tous les sous-types. Cette fonction doit être appelée après chaque modification des attributs ou des classes de bases du type.

source: Return true if the type object *o* sets the feature *feature*. Type features are denoted by single bit flags.
fr: Retourne vrai si l'objet de type *o* met la fonctionnalité *feature*. Les fonctionnalités de type sont marquées par des drapeaux binaire d'un bit.

source: Return true if the type object includes support for the cycle detector; this tests the type flag :const:`Py_TPFLAGS_HAVE_GC`.
fr: Retourne vrai si le type d'objet inclut le support pour le détecteur de cycle; Ceci test le drapeau de type :const:`Py_TPFLAGS_HAVE_GC`.

source: Return true if *a* is a subtype of *b*.
fr: Retourne vrai si *a* est un sous-type de *b*.
